[
  {
    "title": "Developer",
    "company": "Talan Labs",
    "location": "Paris, France",
    "date": "September 2018 to October 2019",
    "description": "I started working at Talan Labs as a developer after my graduation in 2018. I had a strong interest in Blockchain technologies getting out of university and I saw an opportunity there. During my time at Talan Labs I haven't just practiced my Blockchain development skills, I also developed my soft skills and had a complete experience as a front-end developer.",
    "detail": [
      {
        "title": "Blockchain",
        "tasks": [
          "During 5 months I helped mentoring a team of 5 engineering students on a Blockchain project we called Share2Gether: a platform for organizing events with a reputation system to avoid no-show.",
          "In parallel I created a lecture and a practical training on the main concepts of Hyperledger Fabric.",
          "I held lectures on Ethereum and Hyperledger Fabric at my former Engineering School to the graduate students and supervised practical work on Ethereum (Solidity) development",
          "I worked on the evolution of two similar apps: TalanCoin and VCoin, both decentralized coins that allow for more cooperation between co-workers."
        ],
        "tech": [
          "Ethereum",
          "Solidity",
          "Truffle",
          "Ganache"
        ]
      },
      {
        "title": "React",
        "tasks": [
          "I worked at CACIB (Crédit Agricole Corporate and Investment Banking) in an agile team developing an interface that displays market data and allows users to verify and validate those data."
        ],
        "tech": [
          "React",
          "Redux",
          "Jest",
          "Material-UI"
        ]
      }
    ],
    "logo": "Assets/Logos/talan-labs-logo.jpg"
  },
  {
    "title": "Research Assistant",
    "company": "Volkswagen Group",
    "location": "Wolfsburg, Germany",
    "date": "May to November 2017",
    "description": "I did my final internship at the headquarters of Volkswagen in Germany in their Research & Development campus, in the Autonomous Driving department.",
    "detail": [
      {
        "title": "Autonomous Driving",
        "tasks": [
          "I developed a C++ module to estimate the intentions of crossing the road of pedestrians, using a machine learning graphical model (Markov Logic Network)."
        ],
        "tech": [
          "Autonomous Driving",
          "Markov Logic Network"
        ]
      }
    ],
    "logo": "Assets/Logos/vw-group-logo.jpg"
  },
  {
    "title": "Software Engineering Intern",
    "company": "Electronics Research Lab - VWGoA",
    "location": "Belmont, CA, USA",
    "date": "July to December 2015",
    "description": "Voice Recognition: rendering the capabilities of an audio routing platform, enabling testing of speech providers",
    "detail": [
      {
        "title": "Web",
        "tasks": [
          "Implementing a web interface to record and send audio data to various speech providers in order to compare their performances."
        ],
        "tech": [
          "JavaScript",
          "JQuery"
        ]
      }
    ],
    "logo": "Assets/Logos/vw-us-logo.jpg"
  }
]
